app/controllers/api/albums_controller.rb

    def index
        @albums = Album.all;
---
SELECT "albums".* FROM "albums"