app/controllers/api/playlists_controller.rb

    def index
        @playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"