app/models/user.rb

    def reset_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "p7iKNxZD-NK_2wW6AYMdDQ"], ["updated_at", "2019-05-02 20:45:16.109991"], ["id", 32]]

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]